{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"Seraphcex","url":"http://yoursite.com"},"pages":[{"title":"About Me","date":"2018-03-06T14:26:29.696Z","updated":"2018-03-06T14:26:29.696Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"来自广州，现为 广东东软学院 软件工程大三学生，专业方向Android应用开发I’m from Guangzhou China,a junior student in Neusoft Institute Guangdong,major in Software Engineering,mainly focus on developing Android apps."}],"posts":[{"title":"Java Basic--Variable and Constant","slug":"2018-01-22-java-basic-variable-and-constant","date":"2018-01-22T05:50:32.903Z","updated":"2018-01-22T18:40:46.562Z","comments":true,"path":"2018/01/22/2018-01-22-java-basic-variable-and-constant/","link":"","permalink":"http://yoursite.com/2018/01/22/2018-01-22-java-basic-variable-and-constant/","excerpt":"","text":"According to the Java lesson that I took,I’ll divide my notes into 3 parts:basic,medium and advanced.So this is the first section of part 1. KeywordThese words have special purposes in Java,each one has special meaning to the Java compiler,also we need to notice that they are case sensitive.For example12void // this is a keywordVoid // this isn&apos;t a keyword And here are part of keywords that we usually use: abstract boolean break byte case catch char class continue default do double else extends false final finally float for if implements import instanceof int interface long native new null package private protected synchronized this throw throws transient true try void volatile while Pratice12345public class HelloWorld &#123; public static void main(String[] args)&#123; System.out.println(&quot;Hello World&quot;); &#125;&#125; IdentifierIt’s a symbol that we use to name variable,class,method etc. When we use identifier,there are some rules need to be followed: A identifier can consists of letter,number,_,$,and can’t starts with number. Identifier can’t be Java keyword or reserved word. Identifier is case sensitive. Naming a identifier better can inform its meaning or purpose. VariableWe can see it as a box,we can put anything we want into the box,and replace it with new item at any time. In Java,we use 3 elements to describe variable:type,name and value. Also we need to follow rules like: A variable name can consists of letter,number,_,$,and can’t starts with number. Variable name can’t be Java keyword or reserved word. Variable name is case sensitive. Naming a variable name better can inform its meaning or purpose. In order to form a better program habit,there are several naming methods: Hungarian notation Camel case Pascal case Practice123456public class HelloWorld&#123; public static void main(String[] args) &#123; String hobby = &quot;football&quot;; // we declare a variable System.out.println(&quot;My hobby is&quot; + hobby); // we bind those two together with &apos;+&apos;,and print it out &#125;&#125; Data typeJava is a strong typing programming language,it means every data in Java has its own type,and it must be define when Java compiles,want more details click here Practice1234567891011121314public class HelloWorld&#123; public static void main(String[] args) &#123; String name=&quot;Tom&quot;; char sex=&apos;male&apos;; int age=18; double price=120.5; boolean isOK=true; System.out.println(name); System.out.println(sex); System.out.println(num); System.out.println(price); System.out.println(isOK); &#125;&#125; Rules of using variables Variables must declare before using it. 123456public class HelloWorld&#123; public static void main(String[] args) &#123; String name=&quot;Tom&quot;; System.out.println(name); &#125;&#125; You can declare and initialize variables in the same time. 1String name = &quot;Tom&quot;; Also you can first declareit,and then assign it afterward.12String name;name = &quot;Tom&quot;; You can only assign one value to a variable,but you can change multiple time. 12String name = &quot;Tom&quot;;name = &quot;Jack&quot;; The variables that you have declared in method main must be assigned first,and then you can output it. 123456public class HelloWorld&#123; public static void main(String[] args) &#123; String name=&quot;Tom&quot;; System.out.println(name); &#125;&#125; Although you might not have error shows up,but in real life development,I suggest only using english when you naming variables.It’s easier to have safety issues if you use other languages,such as having gibberish when you are working on cross platform. Auto type conversionIn our program,we usually need to convert between differnet primitive data types of data.For example:123int num1 = 82;double num2 = num1;System.out.println(num2); This kind of conversion is called auto type conversion.Of course,it needs to match particular antecedents: Target type is compatible with source type,like double is compatible with int,but char isn’t compatible with int. Target type must larger than source type. Forced type conversionAlthough auto type conversion is pretty convenient,but it can’t match all of our programming needs.So we need something called forced type conversion. syntax: (target type)value 123double num1 = 75.8;int num2 = (int)num1;System.out.println(num2); and then you’ll have175 You can see ,it just simply remove everything to the right of the decimal point(including decimal point itself). Therefore,it’s pretty clear now,using forced type conversion might cause data lost,you need to be careful when you using it. ConstantWe see it as a kind of special variable,when its value has been assigned,it doesn’t allow to change during the operation of your program. syntax: final type name = value; 12final String NAME = &quot;Tom&quot;;final double PI = 3.14; Using constant in your program can improve maintainability,and notice we normally use capital letter while naming a constant. AnnotationWhen we are coding,usually need to add some notes attach to the source code,in order to describe its purpose.It’s a important thing when we talk about coding. There are three kinds of annotation: 12345/** * *@authur Seraphcex *@version v1.0 */ 1234/* *this can include multiple lines * * 1//single line Annotation won’t be executed during the operation,more details click here.","categories":[],"tags":[]},{"title":"Hello World","slug":"2018-01-20-hello-world","date":"2018-01-20T07:43:09.862Z","updated":"2018-01-20T07:45:26.533Z","comments":true,"path":"2018/01/20/2018-01-20-hello-world/","link":"","permalink":"http://yoursite.com/2018/01/20/2018-01-20-hello-world/","excerpt":"","text":"Welcome to my blog! This is my very first post. From now on,though I’m not a native english speaker,I’ll try to write my blog in english and update it mainly with my study &amp; project notes if my time is available.So thank you for reading my blog,any suggestions would be appreciated.","categories":[],"tags":[]}]}